Repository: osaurus-ai/osaurus
Catalog: Packages/OsaurusCore/Resources/Localizable.xcstrings
Source language: en
Languages: ko, ru, zh_hans, zh_hant

source: Decode-split count
ko: 디코드 분할 수
ru: Счетчик разделения декодирования
zh_hans: 解码拆分次数
zh_hant: 解碼拆分次數

source: Decode-throughput options for local vMLX models. Changes apply on the next model load.
ko: 로컬 vMLX 모델의 디코드 처리량 옵션입니다. 변경 사항은 다음 모델 로드 시 적용됩니다.
ru: Параметры пропускной способности декодирования для локальных моделей vMLX. Изменения вступят в силу при следующей загрузке модели.
zh_hans: 本地 vMLX 模型的解码吞吐量选项。更改将在下一次模型加载时生效。
zh_hant: 本地vMLX模型的解碼吞吐量選項。更改將在下一次模型加載時生效。

source: Decrypted %lld store(s); now plaintext at rest.
ko: %lld개의 저장소를 해독했습니다. 이제 저장 시 일반 텍스트로 유지됩니다.
ru: Расшифровано %lld магазинов; теперь открытый текст находится при хранении.
zh_hans: 已解密 %lld 个存储项；现在数据在静默状态下为明文。
zh_hant: 已解密 %lld 個存儲項；現在數據在靜默狀態下爲明文。

source: Decrypts every artifact under ~/.osaurus and writes a plaintext copy to the destination of your choice. Recommended before reinstalling macOS or moving Macs.
ko: ~/.osaurus 아래의 모든 아티팩트를 해독하고 선택한 대상에 일반 텍스트 사본을 작성합니다. macOS를 다시 설치하거나 Mac을 이동하기 전에 권장됩니다.
ru: Расшифровывает все артефакты в ~/.osaurus и записывает незашифрованную копию в выбранное место. Рекомендуется перед переустановкой macOS или переносом на другой Mac.
zh_hans: 解密 `~/.osaurus` 目录下的所有文件，并将明文副本写入你选择的目标位置。建议在重新安装 macOS 或迁移 Mac 之前执行此操作。
zh_hant: 解密 `~/.osaurus` 目錄下的所有文件，並將明文副本寫入您選擇的目標位置。建議在重新安裝 macOS 或遷移 Mac 之前執行此操作。

source: Deep Sleep After (seconds)
ko: 다음 시간 후 깊은 잠자기 (초)
ru: Глубокий сон через (секунд)
zh_hans: 深度休眠等待时间（秒）
zh_hant: 深度休眠等待時間（秒）

source: Default
ko: 기본값
ru: По умолчанию
zh_hans: 默认
zh_hant: 默認

source: Default (agent decides)
ko: 기본값 (에이전트가 결정)
ru: По умолчанию (по решению агента)
zh_hans: 默认（由智能体决定）
zh_hant: 默認（由智能體決定）

source: Default (from global settings)
ko: 기본값 (전역 설정에서)
ru: По умолчанию (из глобальных настроек)
zh_hans: 默认（来自全局设置）
zh_hant: 默認（來自全局設置）

source: Default (global)
ko: 기본값 (전역)
ru: По умолчанию (глобальный)
zh_hans: 默认（全局）
zh_hant: 默認（全局）

source: Default 2.0
ko: 기본값 2.0
ru: По умолчанию 2.0
zh_hans: 默认值 2.0
zh_hant: 默認值 2.0

source: Default Agent
ko: 기본 에이전트
ru: Агент по умолчанию
zh_hans: 默认智能体
zh_hant: 默認智能體

source: Default agent settings unreadable
ko: 기본 에이전트 설정을 읽을 수 없음
ru: Настройки агента по умолчанию не читаются
zh_hans: 无法读取默认智能体设置
zh_hant: 無法讀取默認智能體設置

source: Default Model
ko: 기본 모델
ru: Модель по умолчанию
zh_hans: 默认模型
zh_hant: 默認模型

source: Default recent-message count for iMessage reads. Clamped to 1-100.
ko: iMessage 읽기 시 기본 최근 메시지 수입니다. 1-100으로 제한됩니다.
ru: Количество последних сообщений по умолчанию при чтении iMessage. Ограничено 1–100.
zh_hans: iMessage 读取时默认的最近消息数量。限制在 1-100。

source: Default recent-message count for WhatsApp reads. Clamped to 1-100.
ko: WhatsApp 읽기 시 기본 최근 메시지 수입니다. 1-100으로 제한됩니다.
ru: Количество последних сообщений по умолчанию при чтении WhatsApp. Ограничено 1–100.
zh_hans: WhatsApp 读取时默认的最近消息数量。限制在 1-100。

source: Default Timeout
ko: 기본 시간 초과
ru: Тайм-аут по умолчанию
zh_hans: 默认超时时间
zh_hant: 默認超時時間

source: Default voice for AI-generated greetings + quick actions. Turn greetings on per agent under the agent's Features tab; each agent can also override this voice in its Customization tab.
ko: AI가 생성한 인사말 및 빠른 작업을 위한 기본 음성입니다. 에이전트의 기능 탭에서 에이전트별로 인사말을 켜세요. 각 에이전트는 맞춤 설정 탭에서 이 음성을 재정의할 수도 있습니다.
ru: Голос по умолчанию для приветствий, созданных с помощью ИИ, + быстрые действия. Включите приветствия для каждого агента на вкладке «Функции» агента; каждый агент также может отменить этот голос на вкладке «Настройка».
zh_hans: AI 生成问候语与快捷操作的默认风格。在智能体的“功能”标签页下为每个智能体单独开启问候语；各智能体也可在“自定义”标签页中覆盖此风格。
zh_hant: AI生成問候語和快捷操作的默認語音。在智能體的"功能"標籤下爲每個智能體開啓問候語；每個智能體也可以在"自定義"標籤中覆蓋此語音。

source: Default. Up to 5 relevant tools loaded.
ko: 기본값. 관련 도구가 최대 5개까지 로드됩니다.
ru: По умолчанию. Загружено до 5 соответствующих инструментов.
zh_hans: 默认。最多加载 5 个相关工具。
zh_hant: 默認。最多加載 5 個相關工具。

source: Defaults
ko: 기본값
ru: По умолчанию
zh_hans: 默认值
zh_hant: 默認值

source: Defer First Load
ko: 첫 번째 로드 지연
ru: Отложить первую загрузку
zh_hans: 推迟首次加载
zh_hant: 推遲首次加載

source: Deferred
ko: 지연됨
ru: Отложенный
zh_hans: 延迟
zh_hant: 延遲

source: Define reusable prompt shortcuts. Type / in the chat input to invoke them.
ko: 재사용 가능한 프롬프트 단축키를 정의하세요. 채팅 입력창에 /를 입력하여 호출할 수 있습니다.
ru: Определите многократно используемые ярлыки промптов. Введите / в поле чата, чтобы вызвать их.
zh_hans: 定义可重复使用的提示词快捷指令。在聊天输入框中输入 / 即可调用它们。
zh_hant: 定義可重複使用的提示詞快捷指令。在聊天輸入框中輸入 / 即可調用它們。

source: Define specialized guidance for the AI
ko: AI를 위한 특화된 지침을 정의하세요
ru: Определите специализированное руководство для ИИ
zh_hans: 为 AI 定义专门指引
zh_hant: 爲 AI 定義專門指引

source: Define your own regex patterns — internal codenames, customer IDs, anything Osaurus's built-ins don't cover. Bad patterns are validated before save.
ko: 내부 코드명, 고객 ID 등 Osaurus의 기본 제공 항목이 다루지 않는 고유한 정규식 패턴을 정의하세요. 잘못된 패턴은 저장 전에 유효성 검사를 거칩니다.
ru: Задайте собственные регулярные выражения: внутренние кодовые имена, ID клиентов и всё, что не покрывают встроенные правила Osaurus. Некорректные шаблоны проверяются до сохранения.
zh_hans: 定义你自己的正则表达式模式——内部代号、客户 ID 等任何 Osaurus 内置规则未覆盖的内容。错误的模式会在保存前进行校验。
zh_hant: 定義你自己的正則表達式模式——內部代號、客戶 ID 等任何 Osaurus 內置規則未覆蓋的內容。錯誤的模式會在保存前進行校驗。

source: Defined a database view
ko: 데이터베이스 뷰를 정의했습니다
ru: Определено представление базы данных
zh_hans: 已定义数据库视图
zh_hant: 已定義數據庫視圖

source: Defining a database view
ko: 데이터베이스 뷰 정의 중
ru: Определение представления базы данных
zh_hans: 正在定义数据库视图
zh_hant: 正在定義數據庫視圖

source: Delete
ko: 삭제
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

source: Delete "%@"?
ko: "%@"을(를) 삭제하시겠습니까?
ru: Удалить «%@»?
zh_hans: 删除“%@”？
zh_hant: 刪除「%@」？

source: Delete %lld
ko: %lld 삭제
ru: Удалить %lld
zh_hans: 删除 %lld 个
zh_hant: 刪除 %lld 個

source: Delete %lld rows?
ko: %lld개의 행을 삭제하시겠습니까?
ru: Удалить %lld строк?
zh_hans: 删除 %lld 行？
zh_hant: 刪除 %lld 行？

source: Delete Agent
ko: 에이전트 삭제
ru: Удалить агента
zh_hans: 删除智能体
zh_hant: 刪除智能體

source: Delete Agent Data
ko: 에이전트 데이터 삭제
ru: Удалить данные агента
zh_hans: 删除智能体数据
zh_hant: 刪除智能體數據

source: Delete All Data
ko: 모든 데이터 삭제
ru: Удалить все данные
zh_hans: 删除所有数据
zh_hant: 刪除所有數據

source: Delete Collection
ko: 컬렉션 삭제
ru: Удалить коллекцию
zh_hans: 删除集合
zh_hant: 刪除集合

source: Delete command
ko: 명령 삭제
ru: Удалить команду
zh_hans: 删除命令
zh_hant: 刪除命令

source: Delete Conversation?
ko: 대화를 삭제하시겠습니까?
ru: Удалить разговор?
zh_hans: 删除对话？
zh_hant: 刪除對話？

source: Delete Conversations?
ko: 대화를 삭제하시겠습니까?
ru: Удалить разговоры?
zh_hans: 删除对话？
zh_hant: 刪除對話？

source: Delete Data
ko: 데이터 삭제
ru: Удалить данные
zh_hans: 删除数据
zh_hant: 刪除數據

source: Delete Data…
ko: 데이터 삭제…
ru: Удалить данные…
zh_hans: 删除数据…
zh_hant: 刪除數據…

source: Delete Model
ko: 모델 삭제
ru: Удалить модель
zh_hans: 删除模型
zh_hant: 刪除模型

source: Delete Project?
ko: 프로젝트를 삭제할까요?
ru: Удалить проект?
zh_hans: 删除项目？
zh_hant: 刪除專案？

source: Delete Provider?
ko: 제공자를 삭제하시겠습니까?
ru: Удалить провайдера?
zh_hans: 删除提供商？
zh_hant: 刪除供應商？

source: Delete secret
ko: 비밀 삭제
ru: Удалить секрет
zh_hans: 删除密钥
zh_hant: 刪除密鑰

source: Delete Selected
ko: 선택 항목 삭제
ru: Удалить выбранное
zh_hans: 删除所选
zh_hant: 刪除所選

source: Delete the on-disk model bundle. You'll need to re-download it from the Install button to use the Privacy Filter again.
ko: 디스크의 모델 번들을 삭제합니다. 개인정보 필터를 다시 사용하려면 설치 버튼에서 다시 다운로드해야 합니다.
ru: Удалить пакет модели с диска. Чтобы снова пользоваться фильтром конфиденциальности, модель нужно будет скачать заново кнопкой «Установить».
zh_hans: 删除磁盘上的模型捆绑包。若要再次使用隐私过滤器，你需要通过“安装”按钮重新下载它。
zh_hant: 刪除磁盤上的模型捆綁包。若要再次使用隱私過濾器，你需要通過“安裝”按鈕重新下載它。

source: Delete Theme
ko: 테마 삭제
ru: Удалить тему
zh_hans: 删除主题
zh_hant: 刪除主題

source: Delete this agent's database?
ko: 이 에이전트의 데이터베이스를 삭제하시겠습니까?
ru: Удалить базу данных этого агента?
zh_hans: 删除此智能体的数据库？
zh_hant: 刪除此智能體的數據庫？

source: Delete this response?
ko: 이 응답을 삭제할까요?
ru: Удалить этот ответ?
zh_hans: 删除此回复？
zh_hant: 刪除此回覆？

source: Delete this rule.
ko: 이 규칙을 삭제합니다.
ru: Удалите это правило.
zh_hans: 删除此规则。
zh_hant: 刪除此規則。

source: Deleted
ko: 삭제됨
ru: Удалено
zh_hans: 已删除
zh_hant: 已刪除

source: Deleted "%@"
ko: "%@" 삭제됨
ru: Удален "%@"
zh_hans: 已删除“%@”
zh_hant: 已刪除「%@」

source: Deleted from the database
ko: 데이터베이스에서 삭제되었습니다
ru: Удален из базы данных
zh_hans: 已从数据库中删除
zh_hant: 已從數據庫中刪除

source: Deleted project
ko: 삭제된 프로젝트
ru: Удалённый проект
zh_hans: 已删除的项目
zh_hant: 已刪除的專案

source: Deleting app data
ko: 앱 데이터 삭제 중
ru: Удаление данных приложения
zh_hans: 正在删除应用数据
zh_hant: 正在刪除 App 資料

source: Deleting data and preferences. Please wait…
ko: 데이터 및 환경설정을 삭제하는 중입니다. 잠시 기다려 주십시오…
ru: Удаление данных и настроек. Пожалуйста, подождите…
zh_hans: 正在删除数据和偏好设置。请稍候…
zh_hant: 正在刪除數據和偏好設置。請稍候…

source: Deleting from the database
ko: 데이터베이스에서 삭제 중
ru: Удаление из базы данных
zh_hans: 正在从数据库中删除
zh_hant: 正在從數據庫中刪除

source: Deleting from the middle of the conversation may make the next reply take a little longer to start, since everything after this point has to be reprocessed.
ko: 대화 중간에서 삭제하면 이 지점 이후의 모든 내용을 다시 처리해야 하므로 다음 응답 시작이 조금 더 오래 걸릴 수 있습니다.
ru: Если удалить сообщение из середины беседы, следующий ответ может начаться чуть позже, так как всё после этого места придётся обработать заново.
zh_hans: 从对话中间删除可能会使下一条回复的开始稍慢，因为此处之后的所有内容都需要重新处理。
zh_hant: 從對話中間刪除可能會使下一則回覆的開始稍慢，因為此處之後的所有內容都需要重新處理。

source: Delivery of this message was not confirmed — it may already be visible in the channel. "Send Again" can post a duplicate; use "Mark as Sent" if you can see it in the channel.
ko: 이 메시지의 전달이 확인되지 않았습니다. 이미 채널에 표시되어 있을 수 있습니다. "다시 보내기"는 중복 게시가 될 수 있으니, 채널에서 메시지가 보이면 "전송됨으로 표시"를 사용하세요.
ru: Доставка этого сообщения не подтверждена — оно уже может быть видно в канале. «Отправить снова» может создать дубликат; используйте «Отметить как отправленное», если видите его в канале.
zh_hans: 此消息的送达未获确认——它可能已在频道中可见。“再次发送”可能会重复发布；如果你在频道中看到它，请使用“标记为已发送”。
zh_hant: 此訊息的送達未獲確認——它可能已在頻道中可見。「再次傳送」可能會重複發佈；如果您在頻道中看到它，請使用「標記為已傳送」。

source: Deltas
ko: 델타
ru: Дельты
zh_hans: 增量
zh_hant: 增量

source: Denied
ko: 거부됨
ru: Отклонен
zh_hans: 拒绝
zh_hant: 拒絕

source: Denoising Steps per Canvas
ko: 캔버스당 노이즈 제거 단계
ru: Шаги шумоподавления на холсте
zh_hans: 每画布去噪步数
zh_hant: 每畫布去噪步數

source: Deny
ko: 거부
ru: Отрицать
zh_hans: 拒绝
zh_hant: 拒絕

source: Dependencies
ko: 종속성
ru: Зависимости
zh_hans: 依赖项
zh_hant: 依賴項

source: Dependencies: %@
ko: 종속성: %@
ru: Зависимости: %@
zh_hans: 依赖项：%@
zh_hant: 依賴項：%@

source: Deployments
ko: 배포
ru: Развертывания
zh_hans: 部署
zh_hant: 部署

source: Derive a new agent address and revoke any access keys scoped to the previous one.
ko: 새로운 에이전트 주소를 파생하고 이전 주소로 범위가 지정된 모든 액세스 키를 취소합니다.
ru: Получите новый адрес агента и отзовите все ключи доступа, относящиеся к предыдущему.
zh_hans: 派生一个新的智能体地址，并撤销所有限定于先前地址的访问密钥。
zh_hant: 派生一個新的智能體地址，並撤銷所有限定於先前地址的訪問密鑰。

source: Description
ko: 설명
ru: Описание
zh_hans: 描述
zh_hant: 描述

source: Design a unique look for your chat interface with custom colors, fonts, and effects
ko: 사용자 지정 색상, 글꼴 및 효과로 채팅 인터페이스의 고유한 디자인을 만드세요
ru: Создайте уникальный внешний вид интерфейса чата с помощью пользовательских цветов, шрифтов и эффектов.
zh_hans: 使用自定义颜色、字体和效果，为聊天界面设计独特外观
zh_hant: 使用自定義顏色、字體和效果，爲聊天界面設計獨特外觀

source: Design a unique look for your chat with custom colors, fonts, and backgrounds.
ko: 사용자 지정 색상, 글꼴 및 배경으로 채팅의 고유한 디자인을 만드세요.
ru: Создайте уникальный внешний вид своего чата, используя собственные цвета, шрифты и фон.
zh_hans: 使用自定义颜色、字体和背景为你的聊天设计独特的外观。
zh_hant: 使用自定義顏色、字體和背景爲您的聊天設計獨特的外觀。

source: Destination exists and is not a directory
ko: 대상이 존재하며 디렉토리가 아닙니다
ru: Назначение существует и не является каталогом
zh_hans: 目标已存在且不是目录
zh_hant: 目標已存在且不是目錄

source: Destinations appear here automatically once a connected channel allows the bot to post in at least one room and an agent is chosen to reply there. The agent can then bring things up on its own — and always asks you before sending.
ko: 연결된 채널이 봇의 게시를 최소 한 룸에서 허용하고 그곳에서 답장할 에이전트가 선택되면 대상이 여기에 자동으로 나타납니다. 그러면 에이전트가 스스로 이야기를 꺼낼 수 있으며, 전송 전에 항상 먼저 물어봅니다.
ru: Назначения появляются здесь автоматически, как только подключённый канал разрешает боту публиковать хотя бы в одной комнате и там выбран агент для ответов. Тогда агент может сам поднимать темы — и всегда спрашивает вас перед отправкой.
zh_hans: 一旦已连接的频道允许机器人在至少一个房间发帖，并选择了负责回复的智能体，目标就会自动出现在这里。智能体随后可以主动发起话题——发送前总会先询问你。
zh_hant: 一旦已連接的頻道允許機器人在至少一個房間發文，並選擇了負責回覆的智能體，目標就會自動出現在這裡。智能體隨後可以主動發起話題——傳送前總會先詢問您。

source: Destinations this agent can start messages in on its own — it asks you first unless you change a destination's setting.
ko: 이 에이전트가 스스로 메시지를 시작할 수 있는 대상입니다. 대상 설정을 바꾸지 않는 한 항상 먼저 물어봅니다.
ru: Назначения, где этот агент может сам начинать сообщения — он сначала спрашивает вас, если вы не измените настройку назначения.
zh_hans: 此智能体可以自行发起消息的目标——除非你更改某个目标的设置，否则它会先询问你。
zh_hant: 此智能體可以自行發起訊息的目標——除非您更改某個目標的設定，否則它會先詢問您。

source: Detailed request logs are kept only for a short duration to save storage, so there's nothing to show for this response.
ko: 상세한 요청 로그는 저장 공간을 절약하기 위해 짧은 기간 동안만 보관되므로 이 응답에 대해 표시할 내용이 없습니다.
ru: Подробные журналы запросов хранятся только в течение короткого периода времени для экономии места, поэтому для этого ответа нечего показывать.
zh_hans: 详细的请求日志仅保留较短时间以节省存储空间，因此此响应没有可显示的内容。
zh_hant: 詳細的請求日誌僅保留較短時間以節省存儲空間，因此此響應沒有可顯示的內容。

source: Details
ko: 세부 정보
ru: Подробности
zh_hans: 详情
zh_hant: 詳情

source: Details: %@
ko: 세부 정보: %@
ru: Подробности: %@
zh_hans: 详情：%@
zh_hant: 詳情：%@

source: Detected: %@
ko: 감지됨: %@
ru: Обнаружено: %@
zh_hans: 已检测到：%@
zh_hant: 已檢測到：%@

source: Detection Model
ko: 감지 모델
ru: Модель обнаружения
zh_hans: 检测模型
zh_hant: 檢測模型

source: Detection Patterns
ko: 감지 패턴
ru: Шаблоны обнаружения
zh_hans: 检测模式
zh_hant: 檢測模式

source: Detection sensitivity is configured in the Audio tab
ko: 감지 민감도는 오디오 탭에서 구성됩니다
ru: Чувствительность обнаружения настраивается на вкладке «Аудио».
zh_hans: 检测灵敏度可在“音频”标签页中配置
zh_hant: 檢測靈敏度可在“音頻”標籤頁中配置

source: Detects PII in your messages and asks you to review before any cloud-bound request. Local models (MLX, Foundation) and on-device tools bypass the filter.
ko: 메시지에서 PII를 감지하고 클라우드로 요청을 보내기 전에 검토하도록 요청합니다. 로컬 모델(MLX, Foundation) 및 온디바이스 도구는 필터를 우회합니다.
ru: Обнаруживает PII в ваших сообщениях и просит вас просмотреть их перед любым запросом в облаке. Локальные модели (MLX, Foundation) и инструменты на устройстве обходят фильтр.
zh_hans: 检测你消息中的个人身份信息（PII），并在任何发往云端的请求前请你进行审核。本地模型（MLX、Foundation）和设备端工具会绕过此过滤器。
zh_hant: 檢測你消息中的個人身份信息（PII），並在任何發往雲端的請求前請你進行審核。本地模型（MLX、Foundation）和設備端工具會繞過此過濾器。

source: Developer
ko: 개발자
ru: Разработчик
zh_hans: 开发商
zh_hant: 開發商

source: Developer tools and API reference
ko: 개발자 도구 및 API 참조
ru: Инструменты разработчика и справочник API
zh_hans: 开发者工具和 API 参考
zh_hant: 開發者工具和 API 參考

source: development
ko: 개발
ru: разработка
zh_hans: 开发
zh_hant: 開發

source: Device Address
ko: 기기 주소
ru: Адрес устройства
zh_hans: 设备地址
zh_hant: 設備地址

source: Device ID: %@
ko: 기기 ID: %@
ru: Устройство ID: %@
zh_hans: 设备 ID：%@
zh_hant: 設備 ID：%@

source: DEVICES
ko: 기기
ru: УСТРОЙСТВА
zh_hans: 设备
zh_hant: 設備

source: DFlash speculative decoding
ko: DFlash 추측 디코딩
ru: DFlash спекулятивное декодирование
zh_hans: DFlash 推测解码
zh_hant: DFlash推測解碼

source: DFlash speculative decoding incomplete
ko: DFlash 추측 디코딩이 불완전합니다
ru: DFlash спекулятивное декодирование неполное
zh_hans: DFlash 推测解码不完整
zh_hant: DFlash推測解碼不完整

source: Diagnosing...
ko: 진단 중...
zh_hans: 正在诊断…
zh_hant: 診斷…

source: Diagnostic / Custom
ko: 진단 / 사용자 지정
ru: Диагностический / Пользовательский
zh_hans: 诊断/自定义
zh_hant: 診斷/自定義

source: Diagnostics
ko: 진단
ru: Диагностика
zh_hans: 诊断
zh_hant: 診斷

source: Diagnostics are using %@.
ko: 진단에서 %@을(를) 사용 중입니다.
ru: Диагностика использует %@.
zh_hans: 诊断正在使用 %@。
zh_hant: 診斷正在使用%@。

source: Diffusion Models
ko: 디퓨전 모델
ru: Диффузионные модели
zh_hans: 扩散模型
zh_hant: 擴散模型

source: Direct
ko: 직접
ru: Прямой
zh_hans: 直连
zh_hant: 直接

source: Directory exists and accepted a write probe.
ko: 디렉토리가 존재하며 쓰기 프로브를 수락했습니다.
ru: Каталог существует и принял запрос на запись.
zh_hans: 目录存在并接受了写入探测。
zh_hant: 目錄存在並接受了寫入探測。

source: Directory exists.
ko: 디렉토리가 존재합니다.
ru: Каталог существует.
zh_hans: 目录存在。
zh_hant: 目錄存在。

source: Disable
ko: 사용 안 함
ru: Запрещать
zh_hans: 禁用
zh_hant: 禁用

source: Disable all
ko: 모두 사용 안 함
ru: Отключить все
zh_hans: 全部禁用
zh_hant: 全部禁用

source: Disable memory
ko: 메모리 사용 안 함
ru: Отключить память
zh_hans: 禁用记忆
zh_hant: 禁用記憶

source: Disable Memory?
ko: 메모리를 사용하지 않겠습니까?
ru: Отключить память?
zh_hans: 禁用记忆？
zh_hant: 禁用記憶？

source: Disable pre-flight search. Only explicit tool calls are used.
ko: 실행 전 검색을 사용하지 않습니다. 명시적인 도구 호출만 사용됩니다.
ru: Отключите предполетный поиск. Используются только явные вызовы инструментов.
zh_hans: 禁用预检搜索。仅使用明确的工具调用。
zh_hant: 禁用預檢搜索。僅使用明確的工具調用。

source: Disable request timeout?
ko: 요청 시간 초과를 사용하지 않겠습니까?
ru: Отключить тайм-аут запроса?
zh_hans: 禁用请求超时？
zh_hant: 禁用請求超時？

source: Disable Thinking
ko: 생각 사용 안 함
ru: Отключить мышление
zh_hans: 禁用思考
zh_hant: 禁用思考

source: Disable timeout
ko: 시간 초과 사용 안 함
ru: Отключить тайм-аут
zh_hans: 禁用超时
zh_hant: 禁用超時

source: Disable Timeout
ko: 시간 초과 사용 안 함
ru: Отключить тайм-аут
zh_hans: 禁用超时
zh_hant: 禁用超時

source: Disable tools
ko: 도구 사용 안 함
ru: Отключить инструменты
zh_hans: 禁用工具
zh_hant: 禁用工具

source: Disable Voice Detection
ko: 음성 감지 사용 안 함
ru: Отключить обнаружение голоса
zh_hans: 禁用语音检测
zh_hant: 禁用語音檢測

source: Disabled
ko: 사용 안 함
ru: Отключено
zh_hans: 已禁用
zh_hant: 已禁用

source: Disabled while using an image background.
ko: 이미지 배경을 사용하는 동안에는 사용 안 함으로 설정됩니다.
ru: Отключено при использовании фонового изображения.
zh_hans: 使用图片背景时已禁用。
zh_hant: 使用圖片背景時已禁用。

source: Discard
ko: 버리기
ru: Отказаться
zh_hans: 放弃
zh_hant: 放棄

source: Discarded
ko: 폐기됨
ru: Отклонено
zh_hans: 已丢弃
zh_hant: 已捨棄

source: Disconnect
ko: 연결 해제
ru: Отключить
zh_hans: 断开连接
zh_hant: 斷開連接

source: Disconnected
ko: 연결 해제됨
ru: Отключено
zh_hans: 已断开连接
zh_hant: 斷開連接

source: Discord bot token
ko: Discord 봇 토큰
ru: Токен бота Discord
zh_hans: Discord 机器人令牌
zh_hant: Discord 機器人令牌

source: Discord Community
ko: Discord 커뮤니티
ru: Сообщество Discord
zh_hans: Discord 社区
zh_hant: Discord 社區

# discord.guild.picker
source: Server
ko: 서버
ru: Сервер
zh_hans: 服务器
zh_hant: 服務器

source: Discourage repeats. 1.0 = off; ~1.05–1.15 is typical.
ko: 반복을 제한합니다. 1.0 = 꺼짐; 일반적으로 ~1.05–1.15입니다.
ru: Уныние повторяется. 1,0 = выключено; Типично ~ 1,05–1,15.
zh_hans: 抑制重复。1.0 表示关闭；建议值通常在 1.05 至 1.15 之间。
zh_hant: 抑制重複。1.0 表示關閉；建議值通常在 1.05 至 1.15 之間。

source: Discover and install more themes shared by the Osaurus community
ko: Osaurus 커뮤니티에서 공유하는 더 많은 테마를 발견하고 설치하세요
ru: Найдите и установите больше тем, которыми пользуется сообщество Osaurus.
zh_hans: 发现并安装更多由 Osaurus 社区分享的主题
zh_hant: 發現並安裝更多由 Osaurus 社區分享的主題

source: Discover and run models already on this Mac from other tools. Osaurus references these files in place and never copies, modifies, or deletes them.
ko: 다른 도구에서 이 Mac에 이미 있는 모델을 발견하고 실행하세요. Osaurus는 이러한 파일을 제자리에서 참조하며 복사, 수정 또는 삭제하지 않습니다.
ru: Находите и запускайте модели, уже установленные на этом Mac, с помощью других инструментов. Osaurus ссылается на эти файлы на месте и никогда не копирует, не изменяет и не удаляет их.
zh_hans: 发现并运行这台 Mac 上已有的其他工具中的模型。Osaurus 就地引用这些文件，从不复制、修改或删除它们。
zh_hant: 發現並運行這臺 Mac 上已有的其他工具中的模型。Osaurus 就地引用這些文件，從不複製、修改或刪除它們。

source: Discovery and tool calls use URLSession with the global proxy policy applied.
ko: 검색 및 도구 호출은 전역 프록시 정책이 적용된 URLSession을 사용합니다.
ru: Обнаружение и вызовы инструментов используют сеанс URLS с примененной глобальной политикой прокси.
zh_hans: 发现与工具调用均使用应用了全局代理策略的 URLSession。
zh_hant: 發現與工具調用均使用應用了全局代理策略的 URLSession。

source: Discovery Timeout
ko: 검색 시간 초과
ru: Тайм-аут обнаружения
zh_hans: 发现超时
zh_hant: 發現超時

source: Disk
ko: 디스크
ru: Диск
zh_hans: 磁盘
zh_hant: 磁盤

source: Disk Cache
ko: 디스크 캐시
ru: Дисковый кэш
zh_hans: 磁盘缓存
zh_hant: 磁盤緩存

source: Disk Cache Directory
ko: 디스크 캐시 디렉토리
ru: Каталог дискового кэша
zh_hans: 磁盘缓存目录
zh_hant: 磁盤緩存目錄

source: Disk Cache Size (GB)
ko: 디스크 캐시 크기 (GB)
ru: Размер кэша диска (GB)
zh_hans: 磁盘缓存大小（GB）
zh_hant: 磁盤緩存大小（GB）

source: Disk L2 hits / misses / stores
ko: 디스크 L2 적중 / 실패 / 저장
ru: Диск L2 попадает/промахивается/сохраняет
zh_hans: 磁盘 L2 命中 / 未命中 / 写入
zh_hant: 磁盤 L2 命中 / 未命中 / 寫入

source: Disk Spillover
ko: 디스크 스필오버
ru: Дисковый перелив
zh_hans: 磁盘溢出
zh_hant: 磁盤溢出

source: Dismiss
ko: 닫기
ru: Увольнять
zh_hans: 关闭
zh_hant: 關閉

source: Dismiss Proposal
ko: 제안 기각
ru: Отклонить предложение
zh_hans: 驳回提案
zh_hant: 駁回提案

source: Dismissed proposal #%lld
ko: 제안 #%lld 기각됨
ru: Предложение #%lld отклонено
zh_hans: 已驳回提案 #%lld
zh_hant: 已駁回提案 #%lld

source: Dispatch a work or chat task to an agent
ko: 에이전트에 작업 또는 채팅 작업을 전달하세요
ru: Отправка рабочей задачи или задачи чата агенту
zh_hans: 向智能体分派工作或聊天任务
zh_hant: 向智能體分派工作或聊天任務

source: Display
ko: 디스플레이
ru: Отображать
zh_hans: 显示
zh_hant: 顯示

source: Display notifications for background tasks and events
ko: 백그라운드 작업 및 이벤트에 대한 알림 표시
ru: Отображать уведомления о фоновых задачах и событиях
zh_hans: 显示后台任务和事件的通知
zh_hant: 顯示後臺任務和事件的通知

source: Display text
ko: 텍스트 표시
ru: Отображать текст
zh_hans: 显示文本
zh_hant: 顯示文本

source: Distill buffered turns now, loading the core model if needed
ko: 버퍼링된 대화를 지금 증류합니다. 필요하면 코어 모델을 로드합니다
ru: Дистиллировать буферизованные сообщения сейчас, при необходимости загрузив базовую модель
zh_hans: 立即提炼已缓冲的对话，必要时加载核心模型
zh_hant: 立即提煉已緩衝的對話，必要時載入核心模型

source: Distill pending
ko: 추출 대기 중
ru: Ожидается дистилляция
zh_hans: 待蒸馏
zh_hant: 待蒸餾

source: Distill queue
ko: 추출 대기열
ru: Определить очередь
zh_hans: 蒸馏队列
zh_hant: 蒸餾隊列

source: Distillation is silently disabled. Pick a model in Settings → General.
ko: 추출이 조용히 비활성화되었습니다. 설정 → 일반에서 모델을 선택하세요.
ru: Дистилляция отключена беззвучно. Выберите модель в «Настройки» → «Основные».
zh_hans: 蒸馏功能已静默禁用。请在“设置 → 通用”中选择一个模型。
zh_hant: 蒸餾功能已靜默禁用。請在「設置 → 通用」中選擇一個模型。

source: Distilling...
ko: 추출 중...
zh_hans: 蒸馏中…
zh_hant: 蒸餾中…

source: Do you want Osaurus to auto speak every reply in this chat?
ko: 이 채팅에서 Osaurus가 모든 답장을 자동으로 말하도록 하시겠습니까?
ru: Хотите, чтобы Osaurus автоматически озвучивал каждый ответ в этом чате?
zh_hans: 你希望 Osaurus 在此聊天中自动朗读每条回复吗？
zh_hant: 您希望 Osaurus 在此聊天中自動朗讀每條回復嗎？

source: Document
ko: 문서
ru: Документ
zh_hans: 文档
zh_hant: 文檔

source: Documentation
ko: 문서
ru: Документация
zh_hans: 文档
zh_hant: 文檔

source: Documents
ko: 문서
ru: Документы
zh_hans: 文档
zh_hant: 文件

source: Doesn't look like a 64-character theme ID or osaurus://themes-install link.
ko: 64자 테마 ID 또는 osaurus://themes-install 링크가 아닌 것 같습니다.
ru: Не похоже на 64-символьную ссылку темы ID или osaurus://themes-install.
zh_hans: 看起来不像是一个 64 字符的主题 ID 或 osaurus://themes-install 链接。
zh_hant: 看起來不像是一個 64 字符的主題 ID 或 osaurus://themes-install 鏈接。

source: Don't ask again for similar actions in %@ this run
ko: 이번 실행에서 %@의 유사한 작업에 대해 다시 묻지 않음
ru: Больше не требовать подобных действий в %@ этом забеге.
zh_hans: 本次运行中不再询问 %@ 中的类似操作
zh_hant: 本次運行中不再詢問 %@ 中的類似操作

source: Don't ask me again
ko: 다시 묻지 않음
ru: Не спрашивай меня больше
zh_hans: 不再询问
zh_hant: 不再詢問

source: Don't have a key?
ko: 키가 없으신가요?
ru: У вас нет ключа?
zh_hans: 没有密钥？
zh_hant: 沒有密鑰？

source: Don't have it set up yet?
ko: 아직 설정하지 않으셨나요?
ru: Ещё не настроили?
zh_hans: 还没有设置好？
zh_hant: 還沒有設置好？

source: Don't scan fenced (```) or inline (`) code spans.
ko: 펜스(```) 또는 인라인(`) 코드 범위는 스캔하지 마세요.
ru: Не сканировать изолированные (```) or inline (`) участки кода.
zh_hans: 不扫描围栏式（```）或行内（`）代码片段。
zh_hant: 不掃描圍欄式（```）或行內（`）代碼片段。

source: Don't show this again
ko: 다시 표시하지 않음
ru: Больше не показывать
zh_hans: 不再显示
zh_hant: 不再顯示

source: Done
ko: 완료
ru: Готово
zh_hans: 完成
zh_hant: 完成

source: Done (Esc)
ko: 완료 (Esc)
ru: Готово (Esc)
zh_hans: 完成 (Esc)
zh_hant: 完成 (Esc)

source: Download
ko: 다운로드
ru: Скачать
zh_hans: 下载
zh_hant: 下載

source: Download a model
ko: 모델 다운로드
ru: Скачать модель
zh_hans: 下载模型
zh_hant: 下載模型

source: Download hit a snag
ko: 다운로드에 문제가 발생했습니다
ru: При загрузке возникла проблема
zh_hans: 下载遇到问题
zh_hant: 下載遇到問題
